#**************************OpticalValleyBookstore(光谷书店管理系统数据库设计)**************************
#INSERT INTO book VALUES(bid,bname,bauthor,bpress,bpubdate,moeny,bcount，cid)

INSERT INTO book VALUES("9787557675271","神经外科的黑色喜剧","[美]法兰克·佛杜锡克","湖南科学技术出版社",'2013-11-1',210,210,'00001')

INSERT INTO book VALUES("9787117145954","世界手法医学与传统疗法","韦贵康","人民卫生出版社",'2011-11-1',161,161,'00001'),
("9789866052231","解剖列車：針對徒手及動作治療師的肌筋膜筋線","ThomasW.Myers","愛思唯爾",'2012-06-30',45,45,'00001'),
("9787117095204","儿科学","沈晓明","人民卫生出版社",'2011-10-30',104,104,'00001'),
("9787544782579","医事法","[英国]查尔斯·福斯特","译林出版社",'2020-08-30',28,28,'00001'),
("9787553739762","儿科医生说：当我的孩子生病时","陈英","江苏凤凰科学技术出版社",'2015-08-1',91,20,'00001'),
("9787117096911","口腔颌面科学","邱蔚六主","人民卫生出版社",'2008-01-1',12,12,'00001'),
("9787537733106","医学衷中参西录","张锡纯","山西科技出版社",'2009-01-1',98,48,'00001'),
("9787563346134","走近中医","唐云","广西师范大学出版社",'2004-05-1',151,48,'00001'),
("9787800898341","汪石山医学全书","高尔鑫","中国中医药出版社",'1999-08-1',48,48,'00001'),
("9787111530114","这世界唯一的你:自闭症人士独特行为背后的真相","[美]巴瑞·普瑞桑","机械工业出版社",'2016-03-1',151,151,'00001')

#************************12-14
INSERT INTO category VALUES('00002','教育教学类'),('00003','政治图书类'),('00004','家居休闲类'),('00005','经济管理类'),('00006','工业技术类'),('00007','外语教育类'),('00008','艺术设计类'),('00009','文学小说类'),('00010','社会科学类'),('00011','计算机类');


INSERT INTO book VALUES("9787565715150","游戏心理学","陈京炜","中国传媒大学出版社",'2015-12-1',45,45,'0002'),
("9787309027778","新闻学概论","李良荣","复旦大学出版社",'2005-11-1',32,32,'00002'),
("9787570203451","从小读到大","尹建莉","长江文艺出版社",'2018-4-1',49.8,49,'00002'),
("9787544048446","分心的孩子这样教","[美] 爱德华•哈洛韦尔","山西教育出版社",'2011-6-1',32,32,'00002'),
("9787302508885","自适应学习","李韧","清华大学出版社",'2019-1-1',39.5,20,'00002');

INSERT INTO book VALUES("9787508649528","简化","Cass Sunstein","中信出版社",'2015-1-1',45,45,'00003'),
("9787513594202","谁统治美国？：公司富豪的胜利"," [美] G. 威廉•多姆霍夫","外语教学与研究出版社",'2017-9-1',48,32,'00003'),
("9787010040127","实践理性批判","[德] 伊曼努尔·康德","人民出版社",'2004-5-1',18,18,'00003'),
("9787508645865","无处可藏","[美] 爱德华•哈洛韦尔","中信出版社",'2014-7-1',42,42,'00003'),
("9787521703726","为什么不平等至关重要"," [美]托马斯·斯坎伦","中信出版集",'2019-7-1',48,10,'00003');


INSERT INTO book VALUES("9787304063771","拆出你的沟通力II","赵周","中央广播电视大学出版社",'2014-5-1',32,32,'00004'),
("9787544708173","我不想活得这么累","(日)岸见一郎","现代出版社",'2017-3-1',42,32,'00004'),
("9787514344363","实践理性批判","[德] 伊曼努尔·康德","人民出版社",'2004-5-1',18,18,'00004'),
("9787519305871","内在勇气","林萃芬","群言出版社",'2020-2-1',46.8,30,'00004'),
("9787560963952","心理三术","牧之","华中科技",'2010-9-1',35,10,'00004');


INSERT INTO book VALUES("9787500579359","投资收益百年史","Elroy Dimso","中国财政经济出版社",'2005-6-1',30,30,'00005'),
("9787545402377","股市投资致富之道","（美）菲利普·A.费雪","广东经济出版社",'2009-7-1',32,32,'00005'),
("9787564045838","一看就懂的财务报表全图解","张珈豪","北京理工大学出版社",'2011-6-1',28,28,'00005'),
("9787508633749","随机漫步的傻瓜","[美] 纳西尼古拉斯·塔勒布","中信出版社",'2012-7-1',39,30,'00005'),
("9787508692586","投资21戒","[美]本·斯坦","中信出版社",'2019-6-1',35,10,'00005');

INSERT INTO book VALUES("9787508694399","石油的时代","王能全","中信出版集团",'2018-11-1',198,30,'00006'),
("9787122237088","我是大能手：水暖工","郭超","化学工业出版社",'2016-5-1', 29.8,12,'00006'),
("9787115410986","无人机DIY"," [美] 约翰·贝克托","人民邮电出版社",'2016-5-1',59,28,'00006'),
("9787530477496","DK汽车大百科","英国DK出版社","北京科学技术出版社",'2015-12-1', 198,30,'00006'),
("9787118029468","结构疲劳寿命分析","姚卫星","国防工业出版社",'1900-1-1',24,20,'00006');



INSERT INTO book VALUES("9787801096418","风格的要素"," [美] 威廉·斯特伦克","中央编译出版社",'2009-1-1',20,30,'00007'),
("9787567547612","被解释的美","金雯","华东师范大学出版社",'2018-10-1', 48,12,'00007'),
("9787560089553","如何组织课会话活动","比尔伯勒","外语教学与研究出版社",'2009-9-1',33,33,'00007'),
("9787560091846","循序渐进法语听写","李洪峰","外语教学与研究出版社",' 2009-12-1', 27.5,30,'00007'),
("9787563811854","外贸英语函电","许楠","首都经济贸易大学出版社",'2005-2-1',32,20,'00007');



#**************************`librarymanagements`**************************
#INSERT INTO book VALUES(bid,bname,bauthor,bpress,bpubdate,moeny,bcount，cid)
INSERT INTO book VALUES("9787117031868","麦克明彩色人体解剖图谱","PHAbrahams","人民卫生出版社",'1999-1-1',39,39,'00001')

INSERT INTO book VALUES("9787802318533","身在中医","李灿东","中国纺织出版社",'2018-9-1',28,28,'00001'),
("9787518053001","头等大事：脱发青年自救指南","徐峰","愛思唯爾",'2012-06-30',45,45,'00001'),
("9787303067336","LSD：我那惹是生非的孩子","阿尔伯特.霍夫曼","北京师范大学出版社",'2006-9',664,30,'00001'),
("9787513259156","饮食术","[日]牧田善二","中国中医药出版社",'2020-10',164,30,'00001'),
("9787553739762","儿科医生说：当我的孩子生病时","陈英","江苏凤凰科学技术出版社",'2015-08-1',91,20,'00001'),
("9787117096911","口腔颌面外科学","邱蔚六主","人民卫生出版社",'2008-01-1',12,12,'00001'),
("9787537733106","医学衷中参西录","张锡纯","山西科技出版社",'2009-01-1',98,48,'00001'),
("9787563346134","走近中医","唐云","广西师范大学出版社",'2004-05-1',151,48,'00001'),
("9787800898341","汪石山医学全书","高尔鑫","中国中医药出版社",'1999-08-1',48,48,'00001'),
("9787111530114","这世界唯一的你:自闭症人士独特行为背后的真相","[美]巴瑞·普瑞桑","机械工业出版社",'2016-03-1',151,151,'00001')













