#**************************`librarymanagements`**************************
#INSERT INTO book VALUES(bid,bname,bauthor,bpress,bpubdate,moeny,bcount，cid)
INSERT INTO book VALUES("9787117031868","麦克明彩色人体解剖图谱","PHAbrahams","人民卫生出版社",'1999-1-1',39,39,'00001')

INSERT INTO book VALUES("9787802318533","身在中医","李灿东","中国纺织出版社",'2018-9-1',28,28,'00001'),
("9787518053001","头等大事：脱发青年自救指南","徐峰","愛思唯爾",'2012-06-30',45,45,'00001'),
("9787303067336","LSD：我那惹是生非的孩子","阿尔伯特.霍夫曼","北京师范大学出版社",'2006-9',664,30,'00001'),
("9787513259156","饮食术","[日]牧田善二","中国中医药出版社",'2020-10',164,30,'00001'),
("9787553739762","儿科医生说：当我的孩子生病时","陈英","江苏凤凰科学技术出版社",'2015-08-1',91,20,'00001'),
("9787117096911","口腔颌面外科学","邱蔚六主","人民卫生出版社",'2008-01-1',12,12,'00001'),
("9787537733106","医学衷中参西录","张锡纯","山西科技出版社",'2009-01-1',98,48,'00001'),
("9787563346134","走近中医","唐云","广西师范大学出版社",'2004-05-1',151,48,'00001'),
("9787800898341","汪石山医学全书","高尔鑫","中国中医药出版社",'1999-08-1',48,48,'00001'),
("9787111530114","这世界唯一的你:自闭症人士独特行为背后的真相","[美]巴瑞·普瑞桑","机械工业出版社",'2016-03-1',151,151,'00001');



INSERT INTO book VALUES("9787565715150","游戏心理学","陈京炜","中国传媒大学出版社",'2015-12-1',45,45,'00002'),
("9787309027778","新闻学概论","李良荣","复旦大学出版社",'2005-11-1',32,32,'00002'),
("9787570203451","从小读到大","尹建莉","长江文艺出版社",'2018-4-1',49.8,49,'00002'),
("9787544048446","分心的孩子这样教","[美] 爱德华•哈洛韦尔","山西教育出版社",'2011-6-1',32,32,'00002'),
("9787302508885","自适应学习","李韧","清华大学出版社",'2019-1-1',39.5,20,'00002');


INSERT INTO book VALUES("9787508649528","简化","Cass Sunstein","中信出版社",'2015-1-1',45,45,'00003'),
("9787513594202","谁统治美国？：公司富豪的胜利"," [美] G. 威廉•多姆霍夫","外语教学与研究出版社",'2017-9-1',48,32,'00003'),
("9787010040127","实践理性批判","[德] 伊曼努尔·康德","人民出版社",'2004-5-1',18,18,'00003'),
("9787508645865","无处可藏","[美] 爱德华•哈洛韦尔","中信出版社",'2014-7-1',42,42,'00003'),
("9787521703726","为什么不平等至关重要"," [美]托马斯·斯坎伦","中信出版集",'2019-7-1',48,10,'00003');


INSERT INTO book VALUES("9787304063771","拆出你的沟通力II","赵周","中央广播电视大学出版社",'2014-5-1',32,32,'00004'),
("9787544708173","我不想活得这么累","(日)岸见一郎","现代出版社",'2017-3-1',42,32,'00004'),
("9787514344363","实践理性批判","[德] 伊曼努尔·康德","人民出版社",'2004-5-1',18,18,'00004'),
("9787519305871","内在勇气","林萃芬","群言出版社",'2020-2-1',46.8,30,'00004'),
("9787560963952","心理三术","牧之","华中科技",'2010-9-1',35,10,'00004');


INSERT INTO book VALUES("9787500579359","投资收益百年史","Elroy Dimso","中国财政经济出版社",'2005-6-1',30,30,'00005'),
("9787545402377","股市投资致富之道","（美）菲利普·A.费雪","广东经济出版社",'2009-7-1',32,32,'00005'),
("9787564045838","一看就懂的财务报表全图解","张珈豪","北京理工大学出版社",'2011-6-1',28,28,'00005'),
("9787508633749","随机漫步的傻瓜","[美] 纳西尼古拉斯·塔勒布","中信出版社",'2012-7-1',39,30,'00005'),
("9787508692586","投资21戒","[美]本·斯坦","中信出版社",'2019-6-1',35,10,'00005');